## Books(core)
##### Sarah Musselwhite
##### 10/15/2022

In [1]:
# Imports.
import pandas as pd
import pymysql

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
pymysql.install_as_MySQLdb()

In [3]:
# Connect to MySQL.
username = 'root' 
password = 'root' 

connection = f'mysql+pymysql://{username}:{password}@localhost/books.sql'
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/books.sql)

In [4]:
# Test the connection.
connection

'mysql+pymysql://root:root@localhost/books.sql'

Â ![png](booksmod.png)

In [5]:
# Create the database.
if database_exists(connection) == False: create_database(connection)
else: print('The database already exists.')

The database already exists.

In [6]:
# Verify that the database was created.
database_exists(connection)

True

### Load databases using pandas.

In [19]:
users = pd.read_csv('users.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [21]:
books = pd.read_csv('title.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [22]:
authors = pd.read_csv('author.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [23]:
favorite = pd.read_csv('faves.csv')
favorite.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

#### Adding to Sql

In [25]:
users.to_sql('users', engine, if_exists = 'replace')
books.to_sql('books', engine, if_exists = 'replace')
authors.to_sql('authors', engine, if_exists = 'replace')
favorite.to_sql('favorite', engine, if_exists = 'replace')

7

In [26]:
#show the tables
q = """
SHOW tables;"""
pd.read_sql(q, engine)

  Tables_in_books.sql
0             authors
1               books
2            favorite
3               users

#### List the Titles of John Doe's Favorite Books:

In [35]:
q = """
SELECT books.title, favorite.user_id
FROM books
JOIN favorite ON books.id = favorite.book_id
WHERE favorite.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));

"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1